---
kind: type
id: T:Autodesk.Revit.DB.AssemblyDetailViewOrientation
source: html/941c2468-0a94-b2c0-0c73-1953e15487d6.htm
---
# Autodesk.Revit.DB.AssemblyDetailViewOrientation

Orientation of the Assembly Detail View.

## Syntax (C#)
```csharp
public enum AssemblyDetailViewOrientation
```

## Remarks
The orientation can be specified during creation but not modified for existing views.